content-org/all-posts.org
#+STARTUP: indent
#+HUGO_BASE_DIR: ../
#+SEQ_TODO: TODO DRAFT DONE
#+COLUMNS: %TODO %42ITEM %TAGS

** DONE Game video data on calls in games
CLOSED: [2018-02-21 Wed 11:36]
:PROPERTIES:
:EXPORT_FILE_NAME: rules-video-db
:END:

We are trying to create a database of calls in game videos, to help people learn
the rules better. If you'd like to help with this, please add the URL and the
time stamp of where the call occured in it, to [[https://docs.google.com/spreadsheets/d/1mOa4FA3libM_l0PlbU8Jq2HDeDqHoJkEvKsr225fIsw/edit#gid=0][our DB]].

*** On a Desktop/Laptop browser

If you are watching the video on a latptop, you can use the bookmarklet. [[https://youtu.be/qx3NxdjajHk?t=25][Drag
and drop]] the link below (Capture Call) to your bookmarks bar.

#+BEGIN_EXPORT html
<a style="padding: 10px; border: 1px dashed black;"
   href='javascript: (function() {   var GDOC_URL =     "https://script.google.com/macros/s/AKfycbwSJ8SBv-sWWjsz7uNrx29-7c0GWhk-os0ZsD_bwM_gU_c3TnzQ/exec";   var player = document.querySelector("#movie_player"),     time = player.getCurrentTime(),     url = player.getVideoUrl();    player.pauseVideo();   console.log(url, time);    var form = document.createElement("form");   form.style.setProperty("top", "0px");   form.style.setProperty("position", "absolute");   form.style.setProperty("z-index", "10000");   form.style.setProperty("background", "white");   form.style.setProperty("padding", "5px");   form.style.setProperty("width", "210px");    var call = document.createElement("input");   call.setAttribute("type", "text");   call.setAttribute("name", "call");   call.setAttribute("id", "call");   call.setAttribute("placeholder", "Enter call name");   call.style.setProperty("width", "200px");   form.append(call);    var comment = document.createElement("textarea");   comment.setAttribute("placeholder", "Additional comments if any... ");   comment.style.setProperty("width", "200px");   comment.style.setProperty("height", "300px");   form.append(comment);    var submit = document.createElement("button");   submit.textContent = "Submit";   form.append(submit);   submit.onclick = function(e) {     e.preventDefault();     submit_data(url, time, call.value, comment.value);     form.remove();   };   submit.style.setProperty("background", "lightgreen");    var cancel = document.createElement("button");   cancel.textContent = "X";   cancel.style.setProperty("border", "0px");   cancel.style.setProperty("background", "red");   cancel.style.setProperty("float", "right");   form.append(cancel);   cancel.onclick = function() {     form.remove();   };    document.body.append(form);    var submit_data = function(url, time, call, comment) {     url = encodeURIComponent(url);     time = encodeURIComponent(time);     call = encodeURIComponent(call);     comment = encodeURIComponent(comment);     var data_url = `${GDOC_URL}?url=${url}&time=${time}&call=${call}&comment=${comment}`;     window.open(data_url);   }; })(); '>
  Capture Call
  </a>
#+END_EXPORT

When you wisht to make a note about a call that you are watching on YouTube, you
can click on the bookmarklet (while you are in the video tab), enter some
information, and click submit. The data will get automatically submitted. This
opens a new tab, that you can close and continue watching the video.

*** On other devices

Unfortunately, on other devices, you will have to manually enter this data into
this [[https://docs.google.com/spreadsheets/d/1mOa4FA3libM_l0PlbU8Jq2HDeDqHoJkEvKsr225fIsw/edit#gid=0][Google sheet]].

